app/controllers/application_controller.rb

    def set_current_user
        @current_user = User.find_by(id: session[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]