app/controllers/main_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 2], ["id", 1]]
---
  def top
    #PostモデルとUserモデルの結合
    @posts = Post.all.includes(:user).order(created_at: :desc)

INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "テスト投稿です"], ["created_at", "2022-05-04 16:08:11.386686"], ["updated_at", "2022-05-04 16:08:11.386686"], ["user_id", 1]]
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
  def create
    @post = Post.new(content: params[:content])

    #現在ログインしているユーザーのid
    @post.user_id = @current_user.id
    if @post.save
      flash[:notice] = '投稿が完了しました'
      redirect_to('/top')
    else
      #PostモデルとUserモデルの結合
      @posts = Post.all.includes(:user).order(created_at: :desc)

UPDATE "posts" SET "content" = ?, "password_digest" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "２つ目の投稿\r\n最初の投稿より上に表示されるはず^^\r\n更新したメッセージが表示されるはず!!!"], ["password_digest", "[FILTERED]"], ["updated_at", "2022-04-11 12:45:25.945846"], ["id", 7]]
---
  def update
    #投稿内容の更新
    @post.content = params[:content]
    if @post.save

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 9]]
---
  def destroy
    if @post.destroy

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def set_post
    @post = Post.find_by(id: params[:id])