app/controllers/user_controller.rb

INSERT INTO "users" ("name", "password_digest", "admin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "クチナシ"], ["password_digest", "[FILTERED]"], ["admin", 0], ["created_at", "2022-04-25 14:10:44.191670"], ["updated_at", "2022-04-25 14:10:44.191670"]]
---
  def register
    @user = User.new(name: params[:name], password: params[:password])
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "クチナシ"], ["LIMIT", 1]]
---
  def login
    #名前の一致したデータを取得
    @user = User.find_by(name: params[:name])